impls some more feats
